
@echo off
REM 切换控制台编码为 UTF-8，防止中文乱码
chcp 65001 > nul
title 深大抢场助手 - 启动器

cd src
REM ----------------------------------------------------------------------
REM 阶段一: 运行配置服务器
REM bat 会在这里等待 web_server.py 进程结束 (当用户点击网页上的保存按钮时)
REM ----------------------------------------------------------------------
.\python-env\python.exe web_server.py

echo.
echo ----------------------------------------------------
echo  配置已保存！
echo ----------------------------------------------------
echo.
echo 步骤 2: 正在启动抢票脚本...
echo (脚本将根据你的配置自动运行)
echo.

REM ----------------------------------------------------------------------
REM 阶段二: 配置服务器结束后，自动运行主抢票脚本
REM ----------------------------------------------------------------------
.\python-env\python.exe main.py


echo.
echo ----------------------------------------------------
echo  所有任务已执行完毕！
echo ----------------------------------------------------
pause
exit
