@echo off
chcp 65001 > nul
REM 切换控制台编码为 UTF-8，以正确显示中文
title 深大抢场助手 - 启动器

echo 正在准备启动环境...

REM 切换到包含所有核心文件的 src 目录
REM %~dp0 会获取当前 .bat 文件所在的路径
cd /d "%~dp0src"

REM ----------------------------------------------------------------------
REM 使用打包的Python环境，直接运行主程序 main.py
REM main.py 会处理所有后续流程（启动网页配置、抢票等）
REM ----------------------------------------------------------------------
ECHO. | .\python-env\python.exe main.py


echo.
echo ----------------------------------------------------
echo  所有任务已执行完毕！
echo ----------------------------------------------------
pause
exit

